Tekla.Structures.AnalysisInternal.DotAnalysisArea
The serialization structure for AnalysisArea.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._AnalysisType
The analysis type of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._Label
The label of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._Material
The material of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._Profile
The profile of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._Thickness
The thickness of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._RigidDiaphragm
The rigid diaphragm of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea._AnalysisDesignCode
The analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.ToStruct(Tekla.Structures.Analysis.AnalysisArea)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.FromStruct(Tekla.Structures.Analysis.AnalysisArea)
DO NOT USE! For internal usage only!
P: P.